def zagadka ():
    a= input("Отгадайте загадку:Ах, не трогайте меня: обожгу и без огня!")
    str="крапива"
    if print(a.lower()):
        print("Верно")
    else:
        print("Неправильно")

    b=input("Отгадайте загадку.Деревянный брусок, А на нем растет лесок.")
    str="щетка"
    if print(b.lower()):
        print ("Верно")
    else:
        print("Неправильно")


    c=input("Отгадайте загадку. Из стены торчу, головой кручу, мою и пою целую семью.")
    str="водопроводный кран"
    if print(c.lower()):
        print ("Верно")
    else:
        print("Неправильно")

zagadka()
